# 10月6日(火)にこのOneNoteを基に、対面での勉強会を開きます。
# → しない

# 今回の勉強会の目標
# ・MySQLに触れる！
# ・Pythonからデータベースを操作できるようにする！
#     データの追加・削除

# 流れ
# MySQLを利用できるように、Azureでリソースを作成
# ↓
# リモートで操作できるように設定
# ↓
# MySQLをお使いのPCにインストール (操作するために必要です)
# ↓
# データベースに色々触れてみる
# ↓
# Pythonからデータベースを操作

# 今回の勉強会で書くコードはGitHubにあげてあります
# ダウンロードしておいてください。
# https://github.com/takara2314/mysql-study/


# 1 MySQLを利用できるように、Azureでリソースを作成
# 各自Azureでリソースを作成し、MySQLを利用できる状態にしてください。

# 2 リモートで操作できるように設定
# データベースのデータは、リソースを作成するときに設定したリージョン(地域)にあります。
# わざわざ現地に行かなくても操作できるように設定します。

# 3 お使いのPCにMySQLをインストール
# MySQLをインストールすることによって、データベースをコマンドラインで操作できるようにないｒます。

# 4 データベースに色々触れてみる
# 基本的なデータベースの使い方に慣れましょう。

# 5 Pythonからデータベースを操作
# わざわざ人間がコマンドラインでデータベースを操作するのは面倒です。
# Pythonで自動で取得・削除等の処理ができるようにしましょう。
